//指针与数组的几种写法
void main(){
	int a[] = { 78, 34, 73, 25, 80, 90 };
	int i = 0;
	for (; i < 6; i++){
		printf("%d,%#x	", a[i], &a[i]);
		//a首地址
		//a 等价于 &a[0] ,a+1 等价于&a[1] 
		//结论： a+i 等价于 &a[i]
		//*a等价于 a[0]，*(a+1)等价于a[1]
		//结论： *(a+i)等价于a[i]
		printf("%d,%#x	", *(a + i), a + i);

		printf("\n");
	}
	//总结：
	//a+i 等价于 &a[i]，*(a+i)等价于a[i]，后者只是简写方式，在最古老的C语言里是没有中括号的

	//另外一种写法
	printf("\n\n");
	int* p = a;
	//p变量指针，a常量指针
	//p = &i;
	//a = &i; 不行
	i = 0;
	for (; i < 6; i++){
		//a[i]表达式：首地址[i]
		printf("%d,%#x	", p[i], &p[i]);
		printf("%d,%#x	", *(p + i), p + i);
		printf("\n");
	}

	getchar();
}


//指针引用二维数组（行指针，列指针）

void main(){
	int a[2][3] = {95,82,56,17,29,30};
	//遍历输出
	//外层循环控制行，内层循环控制列
	int i = 0;
	for (; i < 2; i++){
		int j = 0;
		for (; j < 3; j++){
			printf("%d,%#x	", a[i][j], &a[i][j]);
		}
		printf("\n");
	}

	//
	//printf("%#x,%#x,%#x\n",a,&a,*a);
	//printf("%d,%d,%d\n", sizeof(*a), sizeof(*&a), sizeof(**a));
	//a是一个行指针，指向一个有三个元素的数组，12
	//&a是一个指向二维数组的指针，当前二维 数组6个元素，24
	//*a 是一个指向int类型数据的指针（a[0][0]），4
	//printf("%d\n", **a);

	//a是一个行指针，是数组第一行的指针，a+1第二行的指针，以此类推
	printf("%#x,%#x\n",a,a+1);
	//*a是数组的第一行第一个元素的指针，*a+1是数组第一行第二个元素的指针
	printf("%#x,%#x\n",*a,*a+1);
	//*(a+1)是数组的第二（1）行第一(0)个元素的指针
	//注意：不一定是正常逻辑
	printf("%#x,%#x\n",*(a+1),*(a+1)+1);


	//取数组的第1（二）行，第2（三）个元素
	printf("%d\n",a[1][2]);
	printf("%d\n",*(*(a+1)+2));

	//总结：
	//a[i][j] 等价于 *(*(a+i)+j)
	//&a[i][j] 等价于 (*(a+i)+j)

	getchar();
}
